<a href="https://colab.research.google.com/github/Sehaj1904/Data-Science/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**import pandas as pd and numpy as np**

In [1]:
import numpy as np
import pandas as pd

read csv from this url https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv using pandas in df variable.


If any error is printed ignore that.

In [143]:
df = pd.read_csv("https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2882: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

**check the head of DataFrame**

In [144]:
df.head()

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

**use the info method to find out how many entries there are.**

In [145]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

BasePay and OvertimePay both the fields are of **object** type and contains **missing data**, convert them to numeric using

 `pd.to_numeric(df[column_name], errors='coerce')` errors='coerce' will replace all non-numeric values with NaN

 then check datatype using info function

In [5]:
df["BasePay"] = pd.to_numeric(df["BasePay"],errors='coerce')
df["OvertimePay"] = pd.to_numeric(df["OvertimePay"],errors='coerce')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 14.7+ MB

**What is the average BasePay?**

In [7]:
df["BasePay"].mean()

66325.44884050643

**What is the highest amount of OvertimePay in the dataset?**

In [8]:
df["OvertimePay"].max()

245131.88

**What is the Job Title of JOSEPH DRISCOLL?**

In [9]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)**

In [10]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person**

In [11]:
max = df['TotalPayBenefits'].max()
df[df['TotalPayBenefits'] == max]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

**What is the name of lowest paid person (including benefits)?**

In [22]:
min = df['TotalPayBenefits'].min() # DOUBT

In [31]:
# np.where(condition , put value true, put value false)
idx = np.where(df['TotalPayBenefits'].min() == df['TotalPayBenefits'])[0][0]
df.iloc[idx]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [33]:
# ind = df[df['TotalPayBenefits'] == min].T   # transpose
# ind

                                      148653
Id                                    148654
EmployeeName                       Joe Lopez
JobTitle          Counselor, Log Cabin Ranch
BasePay                                  0.0
OvertimePay                              0.0
OtherPay                             -618.13
Benefits                                0.00
TotalPay                             -618.13
TotalPayBenefits                     -618.13
Year                                    2014
Agency                         San Francisco
Status                                    PT

drop the column with **0 non-null** value, then print info

In [14]:
df.drop(columns = ['Notes'],inplace=True)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB

**What was the average (mean) BasePay of all employees per year?(2011, 2014)**

In [16]:
df.groupby('Year')[['BasePay']].mean().reset_index()

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

**How many unique job titles are there**

In [17]:
df['JobTitle'].nunique()

2159

**What are the top 5 most common jobs?**

**value_counts**

Return a Series containing counts of unique values.

The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

In [18]:
df['JobTitle'].value_counts().head() # using head bcoz first 5 kaha hai

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**JobTitles with only one occurence in 2013?**

In [19]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

**How many people has word chief in there jobtitle?**

In [41]:
count = 0
for jt in df['JobTitle']:
  if 'chief' in jt.lower().split():
    count+=1

print(count)

477

**Find correlation of TotalPay with other fields**

In [47]:
df.corr()['TotalPay'] # DOUBT

Id                 -0.211478
BasePay             0.954494
OvertimePay         0.504859
TotalPay            1.000000
TotalPayBenefits    0.977313
Year                0.032090
Name: TotalPay, dtype: float64

In [ ]:
#upar vale me Notes nhi hai kyuki upar humne Notes drop kiya tha lekin jab hum df vapis se sabse upar se run karenge tab Notes vala bhi ajayega

Id                 -0.211478
BasePay             0.954494
OvertimePay         0.504859
Benefits            0.632202
TotalPay            1.000000
TotalPayBenefits    0.977313
Year                0.032090
Notes                    NaN
Name: TotalPay, dtype: float64

**use np.where and replace 'Not Provided' on Benefit column to `np.nan`, then fill all this nan value with 0**

In [149]:
df['Benefits'].iloc[0] == np.nan

False

In [150]:
df['Benefits'] = np.where(df['Benefits'] == 'Not Provided',0,df['Benefits'])

In [151]:
df['Benefits'].fillna(0)

0            0
1            0
2            0
3            0
4            0
          ...
148649    0.00
148650       0
148651       0
148652       0
148653    0.00
Name: Benefits, Length: 148654, dtype: object

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

**Now convert Benefit column to numeric type**

In [153]:
type(df)

pandas.core.frame.DataFrame

In [154]:
df['Benefits'] = pd.to_numeric(df['Benefits'])

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB